results/redis_bench.txt
=== PIPELINE DEPTH: 1 ===
2         Threads
20        Connections per thread
20000     Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        68832.35          ---          ---         0.52234         0.41500         1.95100         6.97500      5309.92 
Gets         7648.04        11.47      7636.57         0.51893         0.41500         1.87100         6.75100       299.08 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      76480.39        11.47      7636.57         0.52200         0.41500         1.93500         6.97500      5609.01 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.031        0.000
SET       0.303        5.000
SET       0.327       10.000
SET       0.343       15.000
SET       0.351       20.000
SET       0.359       25.000
SET       0.375       30.000
SET       0.383       35.000
SET       0.391       40.000
SET       0.399       45.000
SET       0.415       50.000
SET       0.423       52.500
SET       0.431       55.000
SET       0.439       57.500
SET       0.455       60.000
SET       0.463       62.500
SET       0.479       65.000
SET       0.495       67.500
SET       0.503       70.000
SET       0.527       72.500
SET       0.543       75.000
SET       0.551       76.250
SET       0.567       77.500
SET       0.575       78.750
SET       0.591       80.000
SET       0.607       81.250
SET       0.623       82.500
SET       0.647       83.750
SET       0.671       85.000
SET       0.695       86.250
SET       0.719       87.500
SET       0.735       88.125
SET       0.751       88.750
SET       0.775       89.375
SET       0.791       90.000
SET       0.807       90.625
SET       0.831       91.250
SET       0.855       91.875
SET       0.879       92.500
SET       0.903       93.125
SET       0.935       93.750
SET       0.959       94.062
SET       0.975       94.375
SET       0.991       94.688
SET       1.015       95.000
SET       1.039       95.312
SET       1.063       95.625
SET       1.095       95.938
SET       1.127       96.250
SET       1.159       96.562
SET       1.199       96.875
SET       1.223       97.031
SET       1.247       97.188
SET       1.271       97.344
SET       1.303       97.500
SET       1.343       97.656
SET       1.375       97.812
SET       1.423       97.969
SET       1.471       98.125
SET       1.527       98.281
SET       1.583       98.438
SET       1.623       98.516
SET       1.663       98.594
SET       1.711       98.672
SET       1.751       98.750
SET       1.799       98.828
SET       1.863       98.906
SET       1.935       98.984
SET       2.015       99.062
SET       2.111       99.141
SET       2.207       99.219
SET       2.271       99.258
SET       2.335       99.297
SET       2.399       99.336
SET       2.479       99.375
SET       2.559       99.414
SET       2.639       99.453
SET       2.767       99.492
SET       2.895       99.531
SET       3.023       99.570
SET       3.167       99.609
SET       3.295       99.629
SET       3.391       99.648
SET       3.471       99.668
SET       3.631       99.688
SET       3.775       99.707
SET       3.967       99.727
SET       4.191       99.746
SET       4.415       99.766
SET       4.575       99.785
SET       4.799       99.805
SET       4.927       99.814
SET       5.151       99.824
SET       5.311       99.834
SET       5.471       99.844
SET       5.631       99.854
SET       5.791       99.863
SET       6.047       99.873
SET       6.559       99.883
SET       6.783       99.893
SET       7.039       99.902
SET       7.167       99.907
SET       7.295       99.912
SET       7.455       99.917
SET       7.615       99.922
SET       7.999       99.927
SET       8.447       99.932
SET       8.639       99.937
SET       9.023       99.941
SET       9.471       99.946
SET       9.983       99.951
SET      10.047       99.954
SET      10.175       99.956
SET      10.559       99.958
SET      10.815       99.961
SET      10.943       99.963
SET      11.071       99.966
SET      11.135       99.968
SET      11.327       99.971
SET      11.519       99.973
SET      11.711       99.976
SET      11.839       99.977
SET      12.031       99.978
SET      12.287       99.979
SET      12.671       99.980
SET      12.863       99.982
SET      13.119       99.983
SET      13.503       99.984
SET      13.695       99.985
SET      13.951       99.987
SET      14.079       99.988
SET      14.079       99.988
SET      14.207       99.989
SET      14.399       99.990
SET      15.103       99.990
SET      15.743       99.991
SET      15.807       99.991
SET      15.871       99.992
SET      15.935       99.993
SET      16.191       99.993
SET      16.255       99.994
SET      16.383       99.994
SET      16.511       99.995
SET      16.511       99.995
SET      16.639       99.995
SET      18.175       99.995
SET      18.431       99.996
SET      18.431       99.996
SET      27.007       99.996
SET      27.263       99.997
SET      27.263       99.997
SET      27.263       99.997
SET      27.391       99.997
SET      27.519       99.997
SET      27.519       99.998
SET      27.519       99.998
SET      27.519       99.998
SET      27.775       99.998
SET      27.903       99.998
SET      28.927       99.998
SET      29.055       99.998
SET      29.055       99.999
SET      29.183       99.999
SET      29.183       99.999
SET      29.183       99.999
[...]
SET      29.311       99.999
SET      29.311       99.999
SET      29.439       99.999
SET      29.439       99.999
SET      29.567       99.999
SET      29.567       99.999
SET      29.567       99.999
[...]
SET      29.567      100.000
SET      29.567      100.000
SET      29.567      100.000
SET      29.695      100.000
SET      29.695      100.000
SET      29.695      100.000
[...]
SET      32.639      100.000
SET      32.639      100.000
---
GET       0.039        0.000
GET       0.303        5.000
GET       0.327       10.000
GET       0.343       15.000
GET       0.351       20.000
GET       0.359       25.000
GET       0.375       30.000
GET       0.383       35.000
GET       0.391       40.000
GET       0.399       45.000
GET       0.415       50.000
GET       0.423       52.500
GET       0.431       55.000
GET       0.439       57.500
GET       0.447       60.000
GET       0.463       62.500
GET       0.479       65.000
GET       0.487       67.500
GET       0.503       70.000
GET       0.519       72.500
GET       0.543       75.000
GET       0.551       76.250
GET       0.559       77.500
GET       0.575       78.750
GET       0.591       80.000
GET       0.607       81.250
GET       0.623       82.500
GET       0.639       83.750
GET       0.663       85.000
GET       0.687       86.250
GET       0.719       87.500
GET       0.735       88.125
GET       0.751       88.750
GET       0.767       89.375
GET       0.783       90.000
GET       0.807       90.625
GET       0.823       91.250
GET       0.847       91.875
GET       0.871       92.500
GET       0.903       93.125
GET       0.935       93.750
GET       0.951       94.062
GET       0.967       94.375
GET       0.991       94.688
GET       1.007       95.000
GET       1.031       95.312
GET       1.055       95.625
GET       1.079       95.938
GET       1.111       96.250
GET       1.151       96.562
GET       1.191       96.875
GET       1.215       97.031
GET       1.231       97.188
GET       1.255       97.344
GET       1.279       97.500
GET       1.311       97.656
GET       1.351       97.812
GET       1.391       97.969
GET       1.439       98.125
GET       1.503       98.281
GET       1.551       98.438
GET       1.591       98.516
GET       1.623       98.594
GET       1.663       98.672
GET       1.703       98.750
GET       1.735       98.828
GET       1.799       98.906
GET       1.863       98.984
GET       1.919       99.062
GET       1.999       99.141
GET       2.095       99.219
GET       2.143       99.258
GET       2.223       99.297
GET       2.271       99.336
GET       2.351       99.375
GET       2.431       99.414
GET       2.479       99.453
GET       2.543       99.492
GET       2.639       99.531
GET       2.767       99.570
GET       2.911       99.609
GET       2.975       99.629
GET       3.071       99.648
GET       3.183       99.668
GET       3.311       99.688
GET       3.407       99.707
GET       3.599       99.727
GET       3.791       99.746
GET       4.127       99.766
GET       4.287       99.785
GET       4.479       99.805
GET       4.543       99.814
GET       4.671       99.824
GET       4.799       99.834
GET       4.959       99.844
GET       5.215       99.854
GET       5.311       99.863
GET       5.471       99.873
GET       5.919       99.883
GET       6.431       99.893
GET       6.879       99.902
GET       7.039       99.907
GET       7.135       99.912
GET       7.391       99.917
GET       7.487       99.922
GET       8.063       99.927
GET       8.639       99.932
GET       8.703       99.937
GET       9.215       99.941
GET       9.471       99.946
GET       9.855       99.951
GET      10.175       99.954
GET      10.431       99.956
GET      10.815       99.958
GET      10.879       99.961
GET      11.007       99.963
GET      11.071       99.966
GET      11.135       99.968
GET      11.327       99.971
GET      11.775       99.973
GET      12.159       99.976
GET      12.863       99.977
GET      13.439       99.978
GET      13.503       99.979
GET      13.567       99.980
GET      13.567       99.982
GET      13.567       99.983
GET      13.631       99.984
GET      13.631       99.985
GET      13.759       99.987
GET      14.015       99.988
GET      14.015       99.988
GET      14.143       99.989
GET      14.143       99.990
GET      16.319       99.990
GET      16.319       99.991
GET      18.431       99.991
GET      18.431       99.992
GET      27.263       99.993
GET      27.263       99.993
GET      27.519       99.994
GET      27.519       99.994
GET      27.519       99.995
GET      27.519       99.995
GET      27.775       99.995
GET      27.775       99.995
GET      27.775       99.996
GET      27.775       99.996
GET      27.775       99.996
GET      27.775       99.997
GET      27.775       99.997
GET      27.775       99.997
[...]
GET      27.903       99.998
GET      27.903       99.998
GET      27.903       99.998
[...]
GET      27.903       99.999
GET      27.903       99.999
GET      27.903       99.999
GET      29.055       99.999
GET      29.055      100.000
---
WAIT      0.000      100.000



=== PIPELINE DEPTH: 10 ===
2         Threads
20        Connections per thread
20000     Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       414205.88          ---          ---         1.03614         0.81500         4.09500         7.39100     31953.02 
Gets        46022.88        69.03     45953.84         1.03614         0.81500         4.09500         7.39100      1799.77 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     460228.76        69.03     45953.84         1.03614         0.81500         4.09500         7.39100     33752.79 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.055        0.000
SET       0.519        5.000
SET       0.551       10.000
SET       0.583       15.000
SET       0.607       20.000
SET       0.639       25.000
SET       0.671       30.000
SET       0.703       35.000
SET       0.735       40.000
SET       0.775       45.000
SET       0.815       50.000
SET       0.831       52.500
SET       0.855       55.000
SET       0.879       57.500
SET       0.903       60.000
SET       0.935       62.500
SET       0.967       65.000
SET       1.007       67.500
SET       1.055       70.000
SET       1.111       72.500
SET       1.167       75.000
SET       1.191       76.250
SET       1.223       77.500
SET       1.263       78.750
SET       1.295       80.000
SET       1.343       81.250
SET       1.391       82.500
SET       1.431       83.750
SET       1.487       85.000
SET       1.543       86.250
SET       1.607       87.500
SET       1.639       88.125
SET       1.671       88.750
SET       1.711       89.375
SET       1.751       90.000
SET       1.791       90.625
SET       1.831       91.250
SET       1.879       91.875
SET       1.935       92.500
SET       1.991       93.125
SET       2.063       93.750
SET       2.111       94.062
SET       2.143       94.375
SET       2.207       94.688
SET       2.271       95.000
SET       2.335       95.312
SET       2.399       95.625
SET       2.479       95.938
SET       2.559       96.250
SET       2.655       96.562
SET       2.783       96.875
SET       2.831       97.031
SET       2.895       97.188
SET       2.959       97.344
SET       3.023       97.500
SET       3.119       97.656
SET       3.215       97.812
SET       3.295       97.969
SET       3.391       98.125
SET       3.487       98.281
SET       3.583       98.438
SET       3.631       98.516
SET       3.711       98.594
SET       3.775       98.672
SET       3.855       98.750
SET       3.935       98.828
SET       3.983       98.906
SET       4.079       98.984
SET       4.191       99.062
SET       4.319       99.141
SET       4.447       99.219
SET       4.479       99.258
SET       4.543       99.297
SET       4.607       99.336
SET       4.671       99.375
SET       4.735       99.414
SET       4.799       99.453
SET       4.863       99.492
SET       4.959       99.531
SET       5.023       99.570
SET       5.055       99.609
SET       5.119       99.629
SET       5.151       99.648
SET       5.279       99.668
SET       5.343       99.688
SET       5.471       99.707
SET       5.567       99.727
SET       5.695       99.746
SET       5.823       99.766
SET       6.015       99.785
SET       6.239       99.805
SET       6.367       99.814
SET       6.495       99.824
SET       6.559       99.834
SET       6.623       99.844
SET       6.783       99.854
SET       6.847       99.863
SET       6.879       99.873
SET       7.071       99.883
SET       7.295       99.893
SET       7.423       99.902
SET       7.519       99.907
SET       7.583       99.912
SET       7.679       99.917
SET       7.775       99.922
SET       7.839       99.927
SET       7.935       99.932
SET       8.159       99.937
SET       8.767       99.941
SET       8.959       99.946
SET       9.343       99.951
SET       9.471       99.954
SET       9.599       99.956
SET      10.751       99.958
SET      10.879       99.961
SET      12.287       99.963
SET      12.479       99.966
SET      12.607       99.968
SET      12.735       99.971
SET      12.927       99.973
SET      14.399       99.976
SET      14.399       99.977
SET      14.463       99.978
SET      14.463       99.979
SET      14.527       99.980
SET      14.527       99.982
SET      14.527       99.983
SET      14.527       99.984
SET      14.591       99.985
SET      14.591       99.987
SET      14.655       99.988
SET      14.655       99.988
SET      14.719       99.989
SET      14.719       99.990
SET      14.719       99.990
SET      14.719       99.991
SET      14.783       99.991
SET      14.783       99.992
SET      14.847       99.993
SET      14.847       99.993
SET      14.847       99.994
SET      14.847       99.994
SET      14.847       99.995
SET      14.847       99.995
SET      14.847       99.995
[...]
SET      14.847       99.996
SET      14.847       99.996
SET      14.911       99.996
SET      14.911       99.997
SET      14.911       99.997
SET      14.911       99.997
[...]
SET      14.911       99.998
SET      14.911       99.998
SET      14.911       99.998
[...]
SET      14.911       99.999
SET      14.911       99.999
SET      14.911       99.999
SET      14.975       99.999
SET      14.975      100.000
---
GET       0.055        0.000
GET       0.519        5.000
GET       0.551       10.000
GET       0.583       15.000
GET       0.607       20.000
GET       0.639       25.000
GET       0.671       30.000
GET       0.703       35.000
GET       0.735       40.000
GET       0.775       45.000
GET       0.815       50.000
GET       0.831       52.500
GET       0.855       55.000
GET       0.879       57.500
GET       0.903       60.000
GET       0.935       62.500
GET       0.967       65.000
GET       1.007       67.500
GET       1.055       70.000
GET       1.111       72.500
GET       1.167       75.000
GET       1.191       76.250
GET       1.223       77.500
GET       1.263       78.750
GET       1.295       80.000
GET       1.343       81.250
GET       1.391       82.500
GET       1.431       83.750
GET       1.487       85.000
GET       1.543       86.250
GET       1.607       87.500
GET       1.639       88.125
GET       1.671       88.750
GET       1.711       89.375
GET       1.751       90.000
GET       1.791       90.625
GET       1.831       91.250
GET       1.879       91.875
GET       1.935       92.500
GET       1.991       93.125
GET       2.063       93.750
GET       2.111       94.062
GET       2.143       94.375
GET       2.207       94.688
GET       2.271       95.000
GET       2.335       95.312
GET       2.399       95.625
GET       2.479       95.938
GET       2.559       96.250
GET       2.655       96.562
GET       2.783       96.875
GET       2.831       97.031
GET       2.895       97.188
GET       2.959       97.344
GET       3.023       97.500
GET       3.119       97.656
GET       3.215       97.812
GET       3.295       97.969
GET       3.391       98.125
GET       3.487       98.281
GET       3.583       98.438
GET       3.631       98.516
GET       3.711       98.594
GET       3.775       98.672
GET       3.855       98.750
GET       3.935       98.828
GET       3.983       98.906
GET       4.079       98.984
GET       4.191       99.062
GET       4.319       99.141
GET       4.447       99.219
GET       4.479       99.258
GET       4.543       99.297
GET       4.607       99.336
GET       4.671       99.375
GET       4.735       99.414
GET       4.799       99.453
GET       4.863       99.492
GET       4.959       99.531
GET       5.023       99.570
GET       5.055       99.609
GET       5.119       99.629
GET       5.151       99.648
GET       5.279       99.668
GET       5.343       99.688
GET       5.471       99.707
GET       5.567       99.727
GET       5.695       99.746
GET       5.823       99.766
GET       6.015       99.785
GET       6.239       99.805
GET       6.367       99.814
GET       6.495       99.824
GET       6.559       99.834
GET       6.623       99.844
GET       6.783       99.854
GET       6.847       99.863
GET       6.879       99.873
GET       7.071       99.883
GET       7.295       99.893
GET       7.423       99.902
GET       7.519       99.907
GET       7.583       99.912
GET       7.679       99.917
GET       7.775       99.922
GET       7.839       99.927
GET       7.935       99.932
GET       8.159       99.937
GET       8.767       99.941
GET       8.959       99.946
GET       9.343       99.951
GET       9.471       99.954
GET       9.599       99.956
GET      10.751       99.958
GET      10.879       99.961
GET      12.287       99.963
GET      12.479       99.966
GET      12.607       99.968
GET      12.735       99.971
GET      12.927       99.973
GET      14.399       99.976
GET      14.399       99.977
GET      14.463       99.978
GET      14.463       99.979
GET      14.527       99.980
GET      14.527       99.982
GET      14.527       99.983
GET      14.527       99.984
GET      14.591       99.985
GET      14.591       99.987
GET      14.655       99.988
GET      14.655       99.988
GET      14.719       99.989
GET      14.719       99.990
GET      14.719       99.990
GET      14.719       99.991
GET      14.783       99.991
GET      14.783       99.992
GET      14.847       99.993
GET      14.847       99.993
GET      14.847       99.994
GET      14.847       99.994
GET      14.847       99.995
GET      14.847       99.995
GET      14.847       99.995
[...]
GET      14.847       99.996
GET      14.847       99.996
GET      14.911       99.996
GET      14.911       99.997
GET      14.911       99.997
GET      14.911       99.997
[...]
GET      14.911       99.998
GET      14.911       99.998
GET      14.911       99.998
[...]
GET      14.911       99.999
GET      14.911       99.999
GET      14.911       99.999
GET      14.975       99.999
GET      14.975      100.000
---
WAIT      0.000      100.000



=== PIPELINE DEPTH: 50 ===
2         Threads
20        Connections per thread
20000     Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       651383.28          ---          ---         2.75392         2.36700         9.15100        18.81500     50249.56 
Gets        72375.92       108.56     72267.36         2.75392         2.36700         9.15100        18.81500      2830.33 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     723759.21       108.56     72267.36         2.75392         2.36700         9.15100        18.81500     53079.89 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.183        0.000
SET       1.415        5.000
SET       1.559       10.000
SET       1.671       15.000
SET       1.775       20.000
SET       1.879       25.000
SET       1.975       30.000
SET       2.079       35.000
SET       2.175       40.000
SET       2.271       45.000
SET       2.367       50.000
SET       2.415       52.500
SET       2.479       55.000
SET       2.527       57.500
SET       2.607       60.000
SET       2.687       62.500
SET       2.767       65.000
SET       2.863       67.500
SET       2.943       70.000
SET       3.055       72.500
SET       3.151       75.000
SET       3.215       76.250
SET       3.279       77.500
SET       3.327       78.750
SET       3.391       80.000
SET       3.471       81.250
SET       3.535       82.500
SET       3.615       83.750
SET       3.711       85.000
SET       3.775       86.250
SET       3.887       87.500
SET       3.935       88.125
SET       3.999       88.750
SET       4.063       89.375
SET       4.127       90.000
SET       4.223       90.625
SET       4.287       91.250
SET       4.383       91.875
SET       4.511       92.500
SET       4.607       93.125
SET       4.767       93.750
SET       4.831       94.062
SET       4.927       94.375
SET       5.023       94.688
SET       5.151       95.000
SET       5.279       95.312
SET       5.407       95.625
SET       5.567       95.938
SET       5.759       96.250
SET       5.983       96.562
SET       6.239       96.875
SET       6.367       97.031
SET       6.527       97.188
SET       6.687       97.344
SET       6.847       97.500
SET       7.007       97.656
SET       7.199       97.812
SET       7.327       97.969
SET       7.519       98.125
SET       7.711       98.281
SET       7.967       98.438
SET       8.031       98.516
SET       8.159       98.594
SET       8.383       98.672
SET       8.511       98.750
SET       8.639       98.828
SET       8.831       98.906
SET       9.151       98.984
SET       9.343       99.062
SET       9.983       99.141
SET      10.495       99.219
SET      10.815       99.258
SET      11.007       99.297
SET      11.199       99.336
SET      11.455       99.375
SET      11.711       99.414
SET      12.287       99.453
SET      12.415       99.492
SET      12.671       99.531
SET      13.119       99.570
SET      13.503       99.609
SET      13.695       99.629
SET      13.951       99.648
SET      14.143       99.668
SET      14.399       99.688
SET      14.463       99.707
SET      14.719       99.727
SET      15.039       99.746
SET      15.615       99.766
SET      15.807       99.785
SET      15.871       99.805
SET      16.063       99.814
SET      16.255       99.824
SET      17.023       99.834
SET      17.151       99.844
SET      17.407       99.854
SET      17.919       99.863
SET      17.919       99.873
SET      18.431       99.883
SET      18.687       99.893
SET      18.943       99.902
SET      19.199       99.907
SET      19.199       99.912
SET      19.455       99.917
SET      19.455       99.922
SET      19.583       99.927
SET      19.839       99.932
SET      19.839       99.937
SET      19.967       99.941
SET      20.095       99.946
SET      20.351       99.951
SET      20.351       99.954
SET      20.351       99.956
SET      20.479       99.958
SET      20.479       99.961
SET      20.735       99.963
SET      20.735       99.966
SET      20.735       99.968
SET      21.631       99.971
SET      21.631       99.973
SET      21.759       99.976
SET      21.759       99.977
SET      21.759       99.978
SET      21.759       99.979
SET      21.759       99.980
SET      22.143       99.982
SET      22.143       99.983
SET      22.143       99.984
SET      22.143       99.985
SET      22.143       99.987
SET      22.399       99.988
SET      22.399       99.988
SET      22.399       99.989
SET      22.399       99.990
SET      22.399       99.990
SET      22.399       99.991
SET      22.399       99.991
SET      22.399       99.992
SET      22.399       99.993
SET      22.399       99.993
SET      22.655       99.994
SET      22.655      100.000
---
GET       0.183        0.000
GET       1.415        5.000
GET       1.559       10.000
GET       1.671       15.000
GET       1.775       20.000
GET       1.879       25.000
GET       1.975       30.000
GET       2.079       35.000
GET       2.175       40.000
GET       2.271       45.000
GET       2.367       50.000
GET       2.415       52.500
GET       2.479       55.000
GET       2.527       57.500
GET       2.607       60.000
GET       2.687       62.500
GET       2.767       65.000
GET       2.863       67.500
GET       2.943       70.000
GET       3.055       72.500
GET       3.151       75.000
GET       3.215       76.250
GET       3.279       77.500
GET       3.327       78.750
GET       3.391       80.000
GET       3.471       81.250
GET       3.535       82.500
GET       3.615       83.750
GET       3.711       85.000
GET       3.775       86.250
GET       3.887       87.500
GET       3.935       88.125
GET       3.999       88.750
GET       4.063       89.375
GET       4.127       90.000
GET       4.223       90.625
GET       4.287       91.250
GET       4.383       91.875
GET       4.511       92.500
GET       4.607       93.125
GET       4.767       93.750
GET       4.831       94.062
GET       4.927       94.375
GET       5.023       94.688
GET       5.151       95.000
GET       5.279       95.312
GET       5.407       95.625
GET       5.567       95.938
GET       5.759       96.250
GET       5.983       96.562
GET       6.239       96.875
GET       6.367       97.031
GET       6.527       97.188
GET       6.687       97.344
GET       6.847       97.500
GET       7.007       97.656
GET       7.199       97.812
GET       7.327       97.969
GET       7.519       98.125
GET       7.711       98.281
GET       7.967       98.438
GET       8.031       98.516
GET       8.159       98.594
GET       8.383       98.672
GET       8.511       98.750
GET       8.639       98.828
GET       8.831       98.906
GET       9.151       98.984
GET       9.343       99.062
GET       9.983       99.141
GET      10.495       99.219
GET      10.815       99.258
GET      11.007       99.297
GET      11.199       99.336
GET      11.455       99.375
GET      11.711       99.414
GET      12.287       99.453
GET      12.415       99.492
GET      12.671       99.531
GET      13.119       99.570
GET      13.503       99.609
GET      13.695       99.629
GET      13.951       99.648
GET      14.143       99.668
GET      14.399       99.688
GET      14.463       99.707
GET      14.719       99.727
GET      15.039       99.746
GET      15.615       99.766
GET      15.807       99.785
GET      15.871       99.805
GET      16.063       99.814
GET      16.255       99.824
GET      17.023       99.834
GET      17.151       99.844
GET      17.407       99.854
GET      17.919       99.863
GET      17.919       99.873
GET      18.431       99.883
GET      18.687       99.893
GET      18.943       99.902
GET      19.199       99.907
GET      19.199       99.912
GET      19.455       99.917
GET      19.455       99.922
GET      19.583       99.927
GET      19.839       99.932
GET      19.839       99.937
GET      19.967       99.941
GET      20.095       99.946
GET      20.351       99.951
GET      20.351       99.954
GET      20.351       99.956
GET      20.479       99.958
GET      20.479       99.961
GET      20.735       99.963
GET      20.735       99.966
GET      20.735       99.968
GET      21.631       99.971
GET      21.631       99.973
GET      21.759       99.976
GET      21.759       99.977
GET      21.759       99.978
GET      21.759       99.979
GET      21.759       99.980
GET      22.143       99.982
GET      22.143       99.983
GET      22.143       99.984
GET      22.143       99.985
GET      22.143       99.987
GET      22.399       99.988
GET      22.399       99.988
GET      22.399       99.989
GET      22.399       99.990
GET      22.399       99.990
GET      22.399       99.991
GET      22.399       99.991
GET      22.399       99.992
GET      22.399       99.993
GET      22.399       99.993
GET      22.655       99.994
GET      22.655      100.000
---
WAIT      0.000      100.000